import { ThreatCard } from '../../../shared/types.js';

export const threatCards: ThreatCard[] = [
  { title: 'Всё спокойно', description: 'Вам повезло, обошлось без происшествий!', image: '/cards/Угроза/ВСЕ СПОКОЙНО.jpg' },
  { title: 'Затопление', description: 'В бункер проникает вода и вас может просто затопить! Нужно перенастроить компьютерную систему управления бункера или придумать какое-то инженерное решение для откачки воды.', image: '/cards/Угроза/ЗАТОПЛЕНИЕ.jpg' },
  { title: 'Землетрясение', description: 'Небольшое локальное землетрясение грозит смять ваш бункер и повредить системы жизнеобеспечения. Нужно экстренно провести работы по укреплению слабых мест — дверей и вентиляции. Или же останавливать землетрясение какой-то магией.', image: '/cards/Угроза/ЗЕМЛЕТРЯСЕНИЕ.jpg' },
  { title: 'Капча', description: 'ИИ управления бункера «заглючело» и блокирует жизнеобеспечение — необходимо доказать бездушному компьютеру наличие в бункере дышащих живых людей. Тест построен на проверке уникального отличия человека от роботов — способности к творчеству. Вам нужно пройти его.', image: '/cards/Угроза/КАПЧА.jpg' },
  { title: 'Кухонный взрыв', description: 'Обвал в кухонном и складском блоке. Вам помогут персонажи со знанием местности для вылазок и поиска продовольствия или же способные добывать еду в подвалах бункера — устроив ферму или охоту на крыс.', image: '/cards/Угроза/КУХОННЫЙ ВЗРЫВ.jpg' },
  { title: 'Нападение извне', description: 'Какие-то дикие люди ломятся в бункер, надо срочно что-то предпринять. Вам помогут персонажи с военными навыками, охоты, обустройства сигнализации и наблюдения, запасы оружия и электроники.', image: '/cards/Угроза/НАПАДЕНИЕ ИЗВНЕ.jpg' },
  { title: 'Нашествие крыс', description: 'Крысы добрались до ваших запасов провизии и наносят непоправимый ущерб. Вам помогут персонажи, способные истреблять грызунов или дополнительные ресурсы еды.', image: '/cards/Угроза/НАШЕСТВИЕ КРЫС.jpg' },
  { title: 'Отравление воды', description: 'Какой-то сбой с системой очистки воды. Поможет химическая фильтрация. Либо надо как-то добывать чистую воду на вылазках в окрестностях. Иначе вам потребуется медицинская помощь.', image: '/cards/Угроза/ОТРАВЛЕНИЕ ВОДЫ.jpg' },
  { title: 'Призраки', description: 'Паранормальные явления могут нарушить систему жизнеобеспечения бункера. Вам помогут персонажи способные убедить призраков (или что бы это не было) покинуть бункер или же изгнать их.', image: '/cards/Угроза/ПРИЗРАКИ.jpg' },
  { title: 'Пси-атака', description: 'Вероятно, какое-то излучение усиливает стресс и наводит панику. Нужны персонажи / снаряжение которые могут снимать стресс.', image: '/cards/Угроза/ПСИ-АТАКА.jpg' },
  { title: 'Стресс-вирус', description: 'Вспышка смертельного вируса, развивающегося только на фоне стресса. Будут полезны медицинские навыки / снаряжение, а также любые способы контролировать стресс. Не нервничаем, всё хорошо, мы все равно все умрём...', image: '/cards/Угроза/СТРЕСС-ВИРУС.jpg' },
];
